/* If a X500 name has a description and a common name we display CommonName (Description) using this format string */
"%@ (%@)" = "%1$@（%2$@）";

/* Format string used to build a list of values, first argument is list second argument is to be appended element */
"%@, %@" = "%1$@，%2$@";

/* Format string for encoded field data (e.g. Sequence; 128 bytes; data = 00 00 ...) */
"%@; %d %@; data = %@" = "%1$@；%2$d %3$@；数据＝%4$@";

/* format string to turn version number into a string */
"%d" = "%d";

/* Value of a field if its length is 0 */
"<NULL>" = "<空>";

/* CRL Distribution Points extension supported reason name */
"AA Compromise" = "CA 折中";

/* Label of field in authority info access extension */
"Access Location" = "访问位置";

/* Label of field in authority info access extension */
"Access Method" = "访问方法";

/* CRL Distribution Points extension supported reason name */
"Affiliation Changed" = "从属关系已更改";

/* Label of the algorithm subfield of an AlgorithmIdentifer */
"Algorithm" = "算法";

/* Label of field in Authority Key Identifier extension */
"Authority Certificate Serial Number" = "机构证书序列号";

/* Authority info access extension label */
"Authority Information Access" = "机构信息访问";

/* Authority Key Identifier extension label */
"Authority Key Identifier" = "授权密钥标识符";

/* Label used for Basic Constraints when value is invalid */
"Basic Constraints" = "基本约束";

/* First argument to SEC_BLOB_KEY format string for a bit string */
"Bit string" = "位串";

/* No comment provided by engineer. */
"bits" = "位";

/* First argument to SEC_BLOB_KEY format string for a Byte string */
"Byte string" = "字节串";

/* Third argument to SEC_BLOB_KEY format string for a byte string */
"bytes" = "字节";

/* CRL Distribution Points extension supported reason name */
"CA Compromise" = "CA 折中";

/* X.509 key usage bitfield name */
"Cert Sign" = "证书签名";

/* Label for boolean is_ca property of a basic constraints extension */
"Certificate Authority" = "证书代理";

/* CRL Distribution Points extension supported reason name */
"Certificate Hold" = "证书保留";

/* Certificate Policies extension label */
"Certificate Policies" = "证书策略";

/* No comment provided by engineer. */
"Certificate Type" = "证书类型";

/* CRL Distribution Points extension supported reason name */
"Cessation Of Operation" = "操作停止";

/* Label of field in Certificate Policies extension */
"CPS URI" = "CPS URI";

/* Label of field in extension that indicates whether this extension is critical */
"Critical" = "严重";

/* CRL Distribution Points extension label */
"CRL Distribution Points" = "CRL 分发点";

/* Label for CRL issuer field of CRL Distribution Points extension */
"CRL Issuer" = "CRL 发行者";

/* X.509 key usage bitfield name */
"CRL Sign" = "CRL 签名";

/* Label for raw data of extension (used for unknown extensions) */
"Data" = "数据";

/* X.509 key usage bitfield name */
"Data Encipherment" = "数据加密";

/* X.509 key usage bitfield name */
"Decipher Only" = "仅解密";

/* X.509 key usage bitfield name */
"Digital Signature" = "数码签名";

/* label for general name field value */
"Directory Name" = "目录名称";

/* label for general name field value */
"DNS Name" = "DNS 名称";

/* label for general name field value */
"EDI Party Name" = "EDI 用户名称";

/* label for general name field value */
"Email Address" = "电子邮件地址";

/* X.509 key usage bitfield name */
"Encipher Only" = "仅加密";

/* No comment provided by engineer. */
"Expired" = "已过期";

/* Label of expiration date value when certificate is temporally valid */
"Expires" = "过期日期：";

/* Label of field in Certificate Policies extension */
"Explicit Text" = "不良文本内容";

/* Extended key usage extension label */
"Extended Key Usage" = "扩展密钥使用";

/* Label used for General Name entry when value is invalid */
"General Name" = "通用名称";

/* Label used for General Names when value is invalid */
"General Names" = "通用名称";

/* No comment provided by engineer. */
"Hostname mismatch." = "主机名不相符。";

/* Label of field in policy constraints extension */
"Inhibit Policy Mapping" = "禁止策略映射";

/* Label of a value is printed into this string if the data is not valid */
"Invalid %@" = "无效的%@";

/* No comment provided by engineer. */
"Invalid certificate chain linkage." = "无效的证书链链接。";

/* label for general name field value */
"IP Address" = "IP 地址";

/* No comment provided by engineer. */
"Issued By" = "发放者：";

/* No comment provided by engineer. */
"Issuer Name" = "签发者名称";

/* No comment provided by engineer. */
"Issuer Summary" = "签发者摘要";

/* No comment provided by engineer. */
"Issuer Unique ID" = "签发者唯一 ID";

/* X.509 key usage bitfield name */
"Key Agreement" = "密钥协议";

/* CRL Distribution Points extension supported reason name */
"Key Compromise" = "密钥折中";

/* X.509 key usage bitfield name */
"Key Encipherment" = "密钥加密";

/* Label of field in Subject or Authority Key Identifier extension */
"Key Identifier" = "密钥标识符";

/* Subsection label in CRL Distribution Points extension. */
"Name Relative To CRL Issuer" = "与 CRL 签发者相关的名称";

/* Value for a boolean property when it's value is false (example critical: no) */
"No" = "否";

/* X.509 key usage bitfield name */
"Non-Repudiation" = "不拒绝";

/* field value of parameters field when no parameters are present */
"none" = "无";

/* format string for undisplayed field data with a given DER tag and length */
"not displayed (tag = %@; length %d)" = "不显示（标签 = %1$@；长度 %2$d）";

/* label indicating the date after which something is no longer valid */
"Not Valid After" = "在此之后无效";

/* label indicating the soonest date at which something is valid */
"Not Valid Before" = "在此之前无效";

/* Label of field in Certificate Policies extension */
"Notice Numbers" = "通知号码";

/* Netscape certificate type usage value */
"Object Signing" = "对象签名";

/* Netscape certificate type usage value */
"Object Signing CA" = "对象签名 CA";

/* value of an oid field if it's length is more than what we allow for oids */
"Oid too long" = "Oid 太长";

/* No comment provided by engineer. */
"One or more certificates have expired or are not valid yet." = "一个或多个证书已过期或尚未生效。";

/* No comment provided by engineer. */
"One or more unsupported critical extensions found." = "已找到一个或多个不支持的重要扩展。";

/* Label of field in Certificate Policies extension */
"Organization" = "组织";

/* Label used for Other Name RDN when value is invalid */
"Other Name" = "其他名称";

/* Label of the parameters subfield of an AlgorithmIdentifer */
"Parameters" = "参数";

/* Label for path length constraint property of a basic constraints extension */
"Path Length Constraint" = "路径长度限制";

/* Policy constraints extension label */
"Policy Constraints" = "策略约束";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Identifier #%d" = "策略标识符 #%d";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Qualifier #%d" = "策略限定符 #%d";

/* No comment provided by engineer. */
"Policy requirements not met." = "不符合策略要求。";

/* Label for an invlaid private key se perion value */
"Private Key Usage Period" = "专用密钥使用期";

/* CRL Distribution Points extension supported reason name */
"Privilege Withdrawn" = "权限被撤销";

/* No comment provided by engineer. */
"Public Key Algorithm" = "公共密钥算法";

/* No comment provided by engineer. */
"Public Key Data" = "公共密钥数据";

/* Label of field in extended key usage extension */
"Purpose" = "目的";

/* Label of field in Certificate Policies extension */
"Qualifier" = "限定符";

/* Label of a RDN */
"RDN" = "RDN";

/* CRL Distribution Points extension supported reasons bitfield label */
"Reasons" = "原因";

/* label for general name field value */
"Registered ID" = "注册 ID";

/* Label of field in policy constraints extension */
"Require Explicit Policy" = "需要清晰策略";

/* Netscape certificate type usage value */
"Reserved" = "已预留";

/* No comment provided by engineer. */
"Root certificate is not trusted." = "根证书不被信任。";

/* Netscape certificate type usage value */
"S/MIME" = "S/MIME";

/* Netscape certificate type usage value */
"S/MIME CA" = "S/MIME CA";

/* First argument to SEC_BLOB_KEY format string for a Sequence */
"Sequence" = "序列";

/* No comment provided by engineer. */
"Serial Number" = "序列号";

/* First argument to SEC_BLOB_KEY format string for a Set */
"Set" = "设定";

/* No comment provided by engineer. */
"Signature" = "签名";

/* No comment provided by engineer. */
"Signature Algorithm" = "签名算法";

/* Netscape certificate type usage value */
"SSL CA" = "SSL CA";

/* Netscape certificate type usage value */
"SSL client" = "SSL 客户端";

/* Netscape certificate type usage value */
"SSL server" = "SSL 服务器";

/* Subject Key Identifier extension label */
"Subject Key Identifier" = "主题密钥标识符";

/* No comment provided by engineer. */
"Subject Name" = "主题名称";

/* No comment provided by engineer. */
"Subject Unique ID" = "主题唯一 ID";

/* CRL Distribution Points extension supported reason name */
"Superseded" = "已被取代";

/* No comment provided by engineer. */
"This certificate has an issuer that has expired" = "此证书的签发者已过期";

/* No comment provided by engineer. */
"This certificate has an issuer that is not yet valid" = "此证书的一个签发者尚未生效";

/* No comment provided by engineer. */
"This certificate has expired" = "该证书已过期";

/* No comment provided by engineer. */
"This certificate is not yet valid" = "该证书仍然无效";

/* The certificate is temporally valid */
"This certificate is valid" = "该证书有效";

/* Label of a value is printed into this string if the data can not been parsed according to it's type */
"Unparsed %@" = "未解析的%@";

/* CRL Distribution Points extension supported reason name */
"Unused" = "未使用的";

/* label for general name field value */
"URI" = "URI";

/* Label for KeyUsage bitfield values */
"Usage" = "用量";

/* No comment provided by engineer. */
"Valid from" = "有效期从";

/* No comment provided by engineer. */
"Version" = "版本";

/* label for general name field value */
"X.400 Address" = "X.400 地址";

/* Label of a X.501 Name */
"X.501 Name" = "X.501 名称";

/* No comment provided by engineer. */
"X.509 version %d %scertificate" = "X.509v %1$d %2$s证书";

/* Value for a boolean property when it's value is true (example critical: yes) */
"Yes" = "是";

